// Для динамического двумерного массива написать шаблонные функции которые :
// -удаляют строку в конце массива
// - удаляют столбец в конце массива.
// - добавляют новую строку в указанную позицию
// - добавляют новый столбец в указанную позицию
// - удаляют строку в указанной позиции
// - удаляют столбец в начале массива.
// Реализовать использование данных функций для массива :
// -целых чисел 7 * 12
// - символов 12 * 30

#include <iostream>
#include <windows.h>
using namespace std;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    cout << "Hello World!\n";
}
